let $game = {
    playerPositionX: 300,
    playerPositionY: 170,
    walkFreeAreas: [
        [0, 144, 174, 190],
        [130, 162, 320, 351],
        [130, 162, 307, 362],
        [130, 205, 369, 274],
        [130, 162, 338, 272]
    ],
    soilPosition: [[153, 222], [180, 222], [210, 222], [237, 222], [264, 222], [290, 222], [317, 222], [165, 248], [195, 248], [224, 248], [251, 248], [277, 249], [304, 249], [331, 248], [361, 249], [149, 275], [180, 273], [209, 273], [237, 274], [264, 275], [291, 274], [163, 304], [194, 303], [222, 302], [250, 301], [278, 302], [177, 331], [205, 329], [234, 328], [264, 328]],
    playerIsWalking: 0,
    playerOrientation: 2,
    nickname: '',
    worldWidth: 400,
    worldHeight: 400,
    plants: null,
    coin: 0,
    selectedSampling: 0,
    solarTerm: 0,
    solarTermNames: ["立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至", "小寒", "大寒"],
    speciesNames: ['龙井茶', '观音茶','普洱茶','碧螺春','天山白','鹿苑','凤凰'],
    stageNames: ['幼苗', '抽芽', '成熟'],
    weatherData: ['C', 'R', 'C', 'PC', 'RC', 'PC', 'PL', 'LC', 'RL', 'CL', 'CR', 'RCL', 'Y', 'CY', 'RY', 'CY', 'CR', 'C', 'R', 'SC', 'SC', 'C', 'CS', 'S']
}

export default $game